In [39]:
import pandas as pd
import numpy as np
df = pd.read_csv('income.csv',names =['name','income'],skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [17]:
df.income.describe

count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07
Name: income, dtype: float64

In [20]:
percentile_99=df.income.quantile(0.99)
percentile_99

np.float64(9400479.999999994)

In [21]:
df[df.income>percentile_99]

        name    income
6  Elon Musk  10000000

In [22]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [24]:
df['income'][3]=np.nan

C:\Users\adhit\AppData\Local\Temp\ipykernel_4600\385840147.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['income'][3]=np.nan
C:\Users\adhit\AppData\Local\Temp\ipykernel_4600\385840147.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.nan

In [25]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [26]:
df.income.mean()

np.float64(1671666.6666666667)

In [28]:
df_new1 = df.fillna(df.income.mean())
df_new1

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [29]:
df.income.median()

6500.0

In [30]:
df_new2=df.fillna(df.income.median())
df_new2

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [31]:
df.income.mode()

0        4000.0
1        5000.0
2        6000.0
3        7000.0
4        8000.0
5    10000000.0
Name: income, dtype: float64

In [32]:
df['income'][3]=6000

In [33]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6000.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [35]:
#machine learning for probability


import numpy as np

# 1. Define the given probabilities
p_disease = 0.01            # P(D): Probability of having the disease (Prior)
p_no_disease = 1 - p_disease # P(D^c): Probability of not having the disease

p_T_given_D = 0.95          # P(T|D): True Positive Rate
p_T_given_not_D = 0.05      # P(T|D^c): False Positive Rate

# 2. Calculate the total probability of a positive test, P(T)
# P(T) = P(T|D) * P(D) + P(T|D^c) * P(D^c)
p_T = (p_T_given_D * p_disease) + (p_T_given_not_D * p_no_disease)

# 3. Apply Bayes' Theorem to find P(D|T)
# P(D|T) = (P(T|D) * P(D)) / P(T)
p_D_given_T = (p_T_given_D * p_disease) / p_T

# Output the results
print(f"P(D) (Prior Probability): {p_disease}")
print(f"P(T|D) (True Positive Rate): {p_T_given_D}")
print(f"P(T|D^c) (False Positive Rate): {p_T_given_not_D}")
print(f"P(T) (Total Probability of Positive Test): {p_T:.6f}")
print(f"P(D|T) (Posterior Probability of Disease given Positive Test): {p_D_given_T:.4f}")

P(D) (Prior Probability): 0.01
P(T|D) (True Positive Rate): 0.95
P(T|D^c) (False Positive Rate): 0.05
P(T) (Total Probability of Positive Test): 0.059000
P(D|T) (Posterior Probability of Disease given Positive Test): 0.1610

In [40]:
df.income.mean()

np.float64(1433928.5714285714)

In [3]:
b = [1,2]
s,d = b

print(s,d)

1 2